# EnableLBDragAndDrop

## Description
Enables list browser drag and drop.  Use SetLBDragDropColumn to set the drag and drop column.

```pascal
FUNCTION EnableLBDragAndDrop(
				dialogID    : LONGINT;
				componentID : LONGINT;
				enable      : BOOLEAN): BOOLEAN;
```

```python
def vs.EnableLBDragAndDrop(dialogID, componentID, enable):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|enable|BOOLEAN|determines if drag and drop should be enabled|

## Examples
```pascal
{Define kFieldsLB column 2.}
cnt := InsertLBColumn        (AddEditLegend, kFieldsLB, kColNumber, GetPlugInString(10004), 30);
boo := SetLBControlType      (AddEditLegend, kFieldsLB, kColNumber, kLBNumber);
boo := SetLBItemDisplayType  (AddEditLegend, kFieldsLB, kColNumber, kTextOnly);
boo := EnableLBDragAndDrop   (AddEditLegend, kFieldsLB, TRUE);
boo := SetLBDragDropColumn   (AddEditLegend, kFieldsLB, kColNumber);

LBWorkedBool := SetLBControlType (dialog,	kArrayStackLB,	0, kNumberLBCtrlType);
LBWorkedBool := EnableLBDragAndDrop(dialog,	kArrayStackLB,	TRUE);
LBWorkedBool := SetLBDragDropColumn(dialog,	kArrayStackLB,	0);
EnableLBSorting(dialog,						kArrayStackLB,	FALSE);

TmpInt := InsertLBColumn (dialog, kFrntMltColBrowser, 1, GetPlugInString(11162), 79 );		{1 - Color Name}
TmpInt := InsertLBColumn (dialog, kFrntMltColBrowser, 2, GetPlugInString(11163), 60 );		{2 - Color}
bFlipTexture := SetLBControlType (dialog, kFrntMltColBrowser, 0, kNumberLBCtrlType);
EnableLBSorting(dialog, kFrntMltColBrowser, FALSE);
bFlipTexture := EnableLBDragAndDrop(dialog, kFrntMltColBrowser, TRUE);
bFlipTexture := SetLBDragDropColumn(dialog, kFrntMltColBrowser, 0);
DiaColorCountInc := gDiaClrCountTtl;
LBClrCountTtl := 0;
While DiaColorCountInc <> 0 DO
```
```python
import vs

# Enables list browser drag and drop.
dialogID = 1
componentID = 2
enable = True

ok = vs.EnableLBDragAndDrop(dialogID, componentID, enable)
if ok:
    vs.Message('EnableLBDragAndDrop succeeded')
else:
    vs.Message('EnableLBDragAndDrop failed')
```

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern - Browser